{
  "success": true,
  "vote": {
    "id": 102,
    "item_number": "19",
    "title": "19. Early Direction for the Fiscal Year 2024-25 Budget (continued from the meeting \nof March 19, 2024, Item No. 26) ",
    "description": " Early Direction for the Fiscal Year 2024-25 Budget (continued from the meeting \nof March 19, 2024, Item No. 26) \nDepartment(s): Finance and Management Services \nRecommended Action: Provide direction for preparation of the proposed FY \n2024-25 budget. \nMINUTES: Finance and Management Services Director Kathryn Downs provided a \npresentation regarding the Early Direction for the Fiscal Year 2024-25 Budget. \nCouncilmember Hernandez spoke in support of Measure X Committee's \nrecommendation for a feasibility study of a park in vacant land at Washington Square, \nPolice funded ambulance transports, parking validations for City Council meetings, hours \nshifted in parking enforcement, funds for Angel's Park, and re pavement of Civic Center \nDrive. \nCITY COUNCIL 11 APRIL 2, 2024 \n\n\nCouncilmember Bacerra requested a comparison with other cities regarding \nmiscellaneous fees, spoke in support of parking validations for City Council meetings, \nand questioned why there are two contracts related to parking enforcement and services \nand delinquency increased costs. He asked for clarification regarding the parking study \nrates and free parking in structures and paid parking meters, requested a reasonable \nincreased rate regarding the Zoo, expressed concern regarding the expiration of leased \nvehicles agreement, spoke in support of a feasibility study related to opioids, and \nrequested adding five items to exhibit 1 Ñ filling sworn Police Department vacancies, \ninvesting in the water tower observation deck, dedicated left turn signals enhancements \nat the intersections of Raitt and Segerstrom, Flower and MacArthur, and Dyer and \nSegerstrom, and a, formalized agreement for Griset Park. \nDirector Downs spoke regarding the two contractors related to citations and services and \nprovided clarification regarding the status quo vs. regular rates. \nActing Police Chief Robert Rodriguez spoke regarding increased cost for delinquency \nprocessing. \nCouncilmember Penaloza spoke in support of park",
    "outcome": "FLAG",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 18,
    "meeting_date": "2024-04-02",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 5,
        "full_name": "Benjamin Vazquez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "David Penaloza",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Jessie Lopez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 2,
        "full_name": "Johnathan Ryan Hernandez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Phil Bacerra",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Thai Viet Phan",
        "vote_choice": "AYE"
      },
      {
        "member_id": 1,
        "full_name": "Valerie Amezcua",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Public Safety",
      "Infrastructure",
      "Parks & Recreation",
      "Public Works",
      "Transportation",
      "Contracts & Agreements",
      "Appointments",
      "Property & Real Estate"
    ]
  }
}