{
  "success": true,
  "vote": {
    "id": 104,
    "item_number": "21",
    "title": "21.Approve Urgency Ordinance No. NS-XXXX of the City Council of the City of \nSanta Ana, adding Article XXI to Chapter 8 of the Santa Ana Municipal Code \n(SAMC) Prohibiting Short -Term Rentals (STRs) and for First Reading of an \nOrdinance Amending the SAMC Adding Article XXI to Chapter 8 of the SAMC \nProhibiting Short- Term Rentals ",
    "description": "Department(s): Planning and Building Agency \nRecommended Action: \n1. Adopt an urgency ordinance by two-thirds (2/3 vote) amending the Santa Ana \nMunicipal Code (SAMC) to add Article XXI to Chapter 8 of the SAMC prohibiting \nShort -Term Rentals. \nORDINANCE NO. NS-3060 entitled AN URGENCY ORDINANCE OF THE CITY \nCOUNCIL OF THE CITY OF SANTA ANA PURSUANT TO CHARTER \nSECTIONS 415 AND 417 ADDING ARTICLE XXI TO CHAPTER 8 OF THE \nSANTA ANA MUNICIPAL CODE PROHIBITING SHORT-TERM RENTALS \n2. Approve first reading of an ordinance amending the Santa Ana Municipal Code \n(SAMC) to add Article XXI to Chapter 8 of the SAMC prohibiting Short -Term \nRentals. \nORDINANCE NO. NS-3061 entitled AN ORDINANCE OF THE CITY COUNCIL \nOF THE CITY OF SANTA ANA ADDING ARTICLE XXI TO CHAPTER 8 OF THE \nSANTA ANA MUNICIPAL CODE TO PROHIBIT SHORT-TERM RENTALS \n3. Find that, in accordance with the California Environmental Quality Act (CEQA), the \nproposed action is not subject to the requirements of the California \nEnvironmental Quality Act, pursuant to (Guidelines) Section 15060©(2) because \nthe activity will not result in a direct or reasonably foreseeable indirect physical \nchange in the environment and 15060©(3) because the activity is not a project \nas defined in Section 15378 of the CEQA Guidelines, California Code of \nRegulations, Title 14, Chapter 3, because it has no potential for resulting in \nphysical change to the environment, directly or indirectly and so is not a project. \nMINUTES: Planning and Building Director Minh Thai provided a presentation \nregarding Short -Term Rental Ordinance. \nMayor Amezcua asked whether there is a fee charged, noise complaint fees, or \nregulations related to short-term rentals (STR), and spoke regarding potential \nregulations and fines, and requested information be brought back. \nDirector Thai confirmed there is no fee charged and spoke regarding the \nenforcement process and the proposed ordinance. \nCouncilmember Penaloza spoke in support of the item and spoke r",
    "outcome": "FLAG",
    "ayes": 4,
    "noes": 3,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 18,
    "meeting_date": "2024-04-02",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 5,
        "full_name": "Benjamin Vazquez",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 4,
        "full_name": "David Penaloza",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 3,
        "full_name": "Jessie Lopez",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 2,
        "full_name": "Johnathan Ryan Hernandez",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 7,
        "full_name": "Phil Bacerra",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 6,
        "full_name": "Thai Viet Phan",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 1,
        "full_name": "Valerie Amezcua",
        "vote_choice": "ABSENT"
      }
    ]
  }
}