{
  "success": true,
  "vote": {
    "id": 167,
    "item_number": "27",
    "title": "27.Introduction and First Reading of an Ordinance Amending the City of Santa \nAna Municipal Code Article II (Solid Waste Collection Regulations) of Chapter \n16 (Garbage, Trash and Weeds), Article XII (Sanitation Services Users Charge) \nof Chapter 18 (Health and Sanitation), and Article II (Water) of Chapter 39 \n(Water and Sewers) to Comply with the Water Shutoff Protection Act ",
    "description": "Department(s): Finance and Management Services \nRecommended Action: Introduce and approve a first reading of an ordinance to \namend Chapter 16 Article II (Solid Waste Collection Regulations), Chapter 18 \nArticle XII (Sanitation Servicer User Charge), and Chapter 39 Article II (Water and \nSewers) of the Santa Ana Municipal Code. \nORDINANCE NO. NS-3065 entitled AN ORDINANCE OF THE CITY COUNCIL OF \nTHE CITY OF SANTA ANA AMENDING ARTICLE II OF CHAPTER 16, ARTICLE \nXII OF CHAPTER 18, AND ARTICLE II OF CHAPTER 39 OF THE SANTA ANA \nMUNICIPAL CODE TO COMPLY WITH THE WATER SHUTOFF PROTECTION \nACT \nMINUTES: Treasury and Customer Service ManagerAlejandra Gutierrez provided \na presentation regarding amending the Municipal Code to comply with the \nCalifornia Water Shut -Off Protection Act. \nCouncilmember Lopez spoke in support of the item and asked whether \ncommunications are going to be made related to delinquent accounts and \nrequested advertisement on social media. \nFinance Management and Services Executive Director Kathryn Downs provided \nclarification. \nCouncilmember Hernandez spoke in support of the item. \nMOTION: Councilmember Penaloza moved to approve the recommended \naction for Item No. 27, seconded by Councilmember Hernandez. \nThe motion carried, 7-0, by the following roll call vote: \nAYES: COUNCILMEMBER BACERRA, COUNCILMEMBER \nHERNANDEZ, COUNCILMEMBER LOPEZ, \nCOUNCILMEMBER PENALOZA, COUNCILMEMBER \nVAZQUEZ, MAYOR PRO TEM PHAN, MAYOR AMEZCUA \nCITY COUNCIL 17 MAY 21 % 2024 \n\n\nNOES: NONE \nABSTAIN: NONE \nABSENT: NONE \nStatus: 7 Ñ 0 Ñ Pass ",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 14,
    "meeting_date": "2024-05-21",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 5,
        "full_name": "Benjamin Vazquez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "David Penaloza",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Jessie Lopez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 2,
        "full_name": "Johnathan Ryan Hernandez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Phil Bacerra",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Thai Viet Phan",
        "vote_choice": "AYE"
      },
      {
        "member_id": 1,
        "full_name": "Valerie Amezcua",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Public Works",
      "Appointments",
      "Ordinances & Resolutions"
    ]
  }
}