{
  "success": true,
  "vote": {
    "id": 197,
    "item_number": "12",
    "title": "12. Adoption of a Memorandum of Understanding (MOU) Establishing the Terms and \nConditions of Employment for Classifications Represented by the Santa Ana Police \nOfficers Association (SAPOA) Effective January 1, 2024 through June 30, 2027, and \nAdoption of a Resolution Updating the Compensation and Salary Schedule of Sworn \nClassifications of the Santa Ana Police Management Association (SAPMA) ",
    "description": "!i \nDepartment(s): Human Resources \nRecommended Faction- \n1. Authorize the City Manager to execute a Memorandum of Understanding with \nSAPOA regarding wages, hours, and other terms and conditions of employment \neffective January 1, 2024 through June 30, 2027, and authorize non -substantive \nchanges which may be necessary to implement the agreement (Agreement No. \nA-2024-088); and \n2. Approve a Resolution updating the compensation and salary schedule for sworn \nclassifications of the SAPMA. \nRESOLUTION NO. 2024-030 entitled A RESOLUTION OF THE CITY COUNCIL \nOF l-l-IE CITY OF SANTA ANA TO EFFECT CERTAIN CHANGES TO THE \nCITY'S CLASSIFICATION AND COMPENSATION PLAN \nMINUTES Councilmember Penaloza spoke in support of the item. \nMayorAmezcua spoke in support of the item and spoke regarding the need to retain \nand hire personnel. \nCITY COUNCIL 9 JUNE 18, 2024 \n\n\nCouncilmember Lopez spoke regarding the City's structural deficit, asked for \nclarification regarding the impact and plan for funding the following years, and \nexpressed concern regarding the budget trajectory. \nActing City Manager Alvaro Nunez spoke regarding the budget and outlook of \nMeasure X. \nCouncilmember Bacerra spoke in support of the item. \nMayor Pro Tem Phan spoke regarding the cost associated with MOU and previous \nMOU approvals, and in support of the item. \nCouncilmember Vazquez spoke in opposition to the item and expressed concern \nregarding the budget. \nCouncilmember Hernandez spoke in opposition to the item and spoke regarding \nhaving a balanced budget. \nCouncilmember Penaloza spoke regarding the City's fiscal future and previous \nMOU approvals for SAPOA. \nMayor Pro Tem Phan spoke regarding union compensation approvals and police \ncompensation and classification study, and spoke in support of the item. \nCouncilmember Bacerra spoke regarding the political components. \nCouncilmember Lopez spoke regarding fair compensation and competitiveness and \nexpressed concern regarding the fiscal impact. \nMayor Pr",
    "outcome": "PASS",
    "ayes": 0,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 13,
    "meeting_date": "2024-06-18",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 5,
        "full_name": "Benjamin Vazquez",
        "vote_choice": "NAY"
      },
      {
        "member_id": 4,
        "full_name": "David Penaloza",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 3,
        "full_name": "Jessie Lopez",
        "vote_choice": "NAY"
      },
      {
        "member_id": 2,
        "full_name": "Johnathan Ryan Hernandez",
        "vote_choice": "NAY"
      },
      {
        "member_id": 7,
        "full_name": "Phil Bacerra",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 6,
        "full_name": "Thai Viet Phan",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 1,
        "full_name": "Valerie Amezcua",
        "vote_choice": "ABSENT"
      }
    ]
  }
}