{
  "success": true,
  "vote": {
    "id": 205,
    "item_number": "40",
    "title": "40. Public Hearing Ñ Consider an Ordinance to adopt the Fiscal Year 2024-25 \nBudget, Approve a Resolution for Changes to the City's Basic Classification \nand Compensation Plan Budget, Adopt the Uniform Schedule of \nMiscellaneous Fees, and Adopt the Seven -Year Capital Improvement Program \nLegal notice published in the Orange County Reporter on May 22 and 29, 2024. ",
    "description": "Department(s): Finance and Management Services \nRecommended Action: \n1. Approve the introduction and first reading of an Ordinance to adopt the budget \nfor Fiscal Year 2024-25 (FY 2024-25), which begins on July 1, 2024 and ends \non June 30, 2025. \nUNCODIFIED ORDINANCE NO. NS-3067 entitled AN UNCODIFIED \nORDINANCE OF THE CITY COUNCIL OF THE CITY OF SANTA ANA \nAPPROPRIATING MONIES TO THE SEVERAL OFFICES, AGENCIES, AND \nDEPARTMENTS OF THE CITY FOR FISCAL YEAR BUDGET PERIOD \nCOMMENCING JULY 1, 2024 \n2. Adopt a Resolution, to effect certain changes to the City's basic classification \nand compensation plan, such as addition of new classification titles. \nRESOLUTION NO. 2024-XXX entitled A RESOLUTION OF THE CITY \nCOUNCIL OF THE CITY OF SANTA ANA TO EFFECT CERTAIN CHANGES \nTO THE CITY'S CLASSIFICATION AND COMPENSATION PLAN \n3. Adopt a resolution establishing a Uniform Schedule of Miscellaneous Fees for \nFiscal Year 2024-2025. \nRESOLUTION NO. 2024-026 entitled A RESOLUTION OF THE CITY \nCOUNCIL OF THE CITY OF SANTA ANA ESTABLISHING A UNIFORM \nSCHEDULE OF MISCELLANEOUS FEES FOR FISCAL YEAR 2024-2025 \n4. Adopt the Seven -Year Capital Improvement Program (CIP) beginning FY24-25 \nthrough FY30-31, as required by the Orange County Transportation Authority \n(OCTA) for Measure M2 eligibility. \nCITY COUNCIL 18 JUNE 4, 2024 \n\n\n5. Deposit $11,946,740 ($10,531,020 General Fund and $1,415,720 Non -General \nFund) into the Section 115 Pension Trust Fund as part of the City's Pension \nDebt Strategy. \nMINUTES: Finance and Management Services Director Kathryn Downs provided a \npresentation regarding the Fiscal Year 2024-25 Budget and announced one minor \ncorrection to the detailed proposed budget document on pages 183 and 184. She \nstated the police department's staffing table was not updated to reflect the proposed \nbudget however the budget dollars in the proposed document and the proposed \nbudget ordinance are correct and the final budget document would reflect the \ncorrect staffing table. ",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 17,
    "meeting_date": "2024-06-04",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 5,
        "full_name": "Benjamin Vazquez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "David Penaloza",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Jessie Lopez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 2,
        "full_name": "Johnathan Ryan Hernandez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Phil Bacerra",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Thai Viet Phan",
        "vote_choice": "AYE"
      },
      {
        "member_id": 1,
        "full_name": "Valerie Amezcua",
        "vote_choice": "AYE"
      }
    ]
  }
}