{
  "success": true,
  "vote": {
    "id": 239,
    "item_number": "27",
    "title": "PUBLIC COMMENTS-- Members of the public may address the City Council on each of \nthe Public Hearing items. \nMINUTES: At 7.40 P.M., the Public Hearing was considered. \n27. Public Hearing Ñ Approve an Amended and Restated Regulatory Agreement \nfor the Rehabilitation of Garden Court Apartments Located at 300 East Santa \nAna Boulevard, Santa Ana, CA 92701, Adopt a Resolution Approving the \nIssuance of Revenue Bonds, and Conduct a Tax Equity Fiscal Responsibility \nAct (TEFRA) Hearing \nLegal notice pu",
    "description": "Department(s): Community Development Agency \nRecommended Action: \n1. Authorize the City Manager to execute an amended and restated agreement \ncontaining Affordable Housing Covenants with Orange Housing Development \nCorporation for the rehabilitation of Garden Court Apartments located at 300 \nEast Santa Ana Boulevard, Santa Ana, CA 92701 (APN 398-323-08) \n(Contingent upon approval of Housing Authority Item # 3) (Agreement No. A- \n2024-9 06). \n2. Approve the Relocation Plan and authorize the City Manager to approve \nCITY COUNCIL 17 JULY 16, 2024 \n\n\namendments to the Relocation Plan prior to commencement of the rehabilitation \nof Garden Court Apartments, substantially in the draft form attached hereto, \nsubject to changes consistent with the project approved by the City Manager \nand City Attorney. \n3. Conduct a Tax Equity and Financial Responsibility Act Hearing in consideration \nof the issuance of tax-exempt bond financing by the California Municipal Finance \nAuthority for C&C Development Co., LLC, to finance the acquisition, \nrehabilitation, improvement, and equipping of Garden Court Apartments located \nat 300 East Santa Ana Boulevard, Santa Ana, CA 92701 (APN 398-323-08). \n4. Adopt a resolution approving the issuance of revenue bonds by the California \nMunicipal Finance Authority in an amount not to exceed $55,000,000 for \nfinancing the rehabilitation of Garden Court Apartments. \nRESOLUTION NO. 2024-045 entitled A RESOLUTION OF THE CITY \nCOUNCIL OF THE CITY OF SANTA ANA APPROVING THE ISSUANCE BY \nTHE CALIFORNIA MUNICIPAL FINANCE AUTHORITY OF EXEMPT \nFACILITY BONDS FOR THE GARDEN COURT APARTMENTS \n5. Determine that the approvals and authorizations provided for herein do not \nconstitute a \"project\" within the meaning of California Public Resources Code ¤ \n21065 and authorize filing a notice of exemption based on the \"common sense\" \nexemption of 14 C.C.R. ¤ 15061(b)(3) to the extent any activity would be \nconsidered a \"project\" because it can be seen with certainty tha",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 15,
    "meeting_date": "2024-07-16",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 5,
        "full_name": "Benjamin Vazquez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "David Penaloza",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Jessie Lopez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 2,
        "full_name": "Johnathan Ryan Hernandez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Phil Bacerra",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Thai Viet Phan",
        "vote_choice": "AYE"
      },
      {
        "member_id": 1,
        "full_name": "Valerie Amezcua",
        "vote_choice": "AYE"
      }
    ]
  }
}