{
  "success": true,
  "vote": {
    "id": 289,
    "item_number": "39",
    "title": "39.Ordinance Amending Article VI Stadium Sec. 2-743 Liquor of the Santa Ana \nMunicipal Code to Allow for the Sale and Consumption of Beer, Wine, and \nDistilled Spirits at Eddie West Field -Santa Ana Stadium ",
    "description": "Department(s): Parks, Recreation, and Community Services \nRecommended Action: \n1. Approve first reading of an ordinance amending Article VI (Stadium), Section 2- \n743 (Liquor) of the Santa Ana Municipal Code (SAMC) (Exhibit 1) to allow for \nthe sale and consumption of beer, wine, and distilled spirits at Eddie West Field - \nSanta Ana Stadium with the expressed written consent of the City Manager or \ndesignee. \nORDINANCE NO. NS-3069 entitled AN ORDINANCE OF THE CITY COUNCIL \nOF THE CITY OF SANTA ANA AMENDING CHAPTER 2 OF THE SANTA ANA \nMUNICIPAL CODE (ADMINISTRATION), ARTICLE Vl (STADIUM), SECTION \n2-743 Ñ LIQUOR \n2. Determine that, in accordance with the California Environmental Quality Act \n(CEQA) and the CEQA Guidelines, the project is categorically exempt from \nfurther review per Section 15301 (Class 1 Ñ Existing Facilities). \n3. \nMINUTES: Assistant City Manager Steven Mendoza presented the staff report and \nstated the purpose of the item is to enhance the venue's marketability and \ncompetitiveness. \nMayor Amezcua requested clarification on the number of vendors and security for \nsuch events. \nCouncilmember Bacerra spoke in support of the item and requested to strike out \nlanguage of \"adult event.\" \nMayor Pro Tem Phan spoke in support of striking out language of \"adult event.\" \nCouncilmember Hernandez spoke in support of the item and striking out \"adult\" \nlanguage and requested to increase visibility of language that encourages safe, \nresponsible drinking and to promote local downtown businesses. \nCouncilmember Penaloza spoke in support of the item and recommended \namendments to the ordinance language. \nCouncilmember Bacerra asked whether the City has an ABC license for the \nstadium. \nCITY COUNCIL 21 AUGUST 20, 2024 \n\n\nCity Manager Alvaro Nunez stated the City currently does not have an ABC license, \nspoke regarding the process of obtaining the license in the future, and stated \nvendors would have the ABC license. \nMOTION: Councilmember Hernandez moved to approve",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 0,
    "abstain": 1,
    "absent": 0,
    "meeting_id": 22,
    "meeting_date": "2024-08-20",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 5,
        "full_name": "Benjamin Vazquez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "David Penaloza",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Jessie Lopez",
        "vote_choice": "ABSENT"
      },
      {
        "member_id": 2,
        "full_name": "Johnathan Ryan Hernandez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Phil Bacerra",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Thai Viet Phan",
        "vote_choice": "AYE"
      },
      {
        "member_id": 1,
        "full_name": "Valerie Amezcua",
        "vote_choice": "AYE"
      }
    ]
  }
}