{
  "success": true,
  "vote": {
    "id": 340,
    "item_number": "16",
    "title": "16. Purchase and Sale Agreement and Appropriation Adjustment, in the Same \nAmount for the Sale of City -owned Real Property, Formerly Portions of 1601 \nand 1607 North Bristol Street, to Bristol Center Properties, LLC; Amend \nPurchase and Sale Agreement with Bristol Center Properties to Extend the \nDeadline to Open A Drive-Thru Restaurant or Drive-Thru Cafe at 1601 and \n1607 North Bristol Street by 18 Months (Non -General Fund) ",
    "description": "Department(s): Public Works Agency \nRecommended Action: \n1. Approve an appropriation adjustment recognizing revenue in the amount of \n$2,989 in the Select Street Construction Fund, Sale of Land revenue account \nfor Fiscal Year 2024-25 from the sale of City -owned property formerly portions \nof 1601 and 1607 North Bristol Street and appropriating the same amount to the \nOCTA Bristol Street Corridor Improvements, Improvements Other Than Building \nexpenditure account. Receipt of Measure M Street Construction proceeds in the \namount of $6,811 will be disbursed to the Orange County Transportation \nAuthority (OCTA). (Requires five affirmative votes) \n2. Approve an amendment to the Fiscal Year 2024-25 Capital Improvement \nProgram to include $2,989 of funding into the Bristol Street Improvements \nProject (No. 11-6741). \n3. Authorize the City Manager to execute a purchase and sale agreement with \nBristol Center Properties, LLC for the sale of 392 square feet of City -owned \nproperty formerly portions of 1601 and 1607 North Bristol Street (APN 405-252- \n21 & 22), in the amount of $9,800 (Agreement No. A-2024-166). \n4. Authorize the City Manager to execute the first amendment to the agreement \nwith Bristol Center Properties to extend the deadline to open for business to the \nCITY COUNCIL 12 OCTOBER 15, 2024 \n\n\npublic for a drive-thru restaurant or drive-thru caf6 at 1601 and 1607 North Bristol \nStreet by 18 months (Agreement No. A-2024-167). ",
    "outcome": "PASS",
    "ayes": 7,
    "noes": 0,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 12,
    "meeting_date": "2024-10-15",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 5,
        "full_name": "Benjamin Vazquez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "David Penaloza",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Jessie Lopez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 2,
        "full_name": "Johnathan Ryan Hernandez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Phil Bacerra",
        "vote_choice": "AYE"
      },
      {
        "member_id": 6,
        "full_name": "Thai Viet Phan",
        "vote_choice": "AYE"
      },
      {
        "member_id": 1,
        "full_name": "Valerie Amezcua",
        "vote_choice": "AYE"
      }
    ]
  }
}