{
  "success": true,
  "vote": {
    "id": 427,
    "item_number": "22",
    "title": "AGENDA ITEM NO. 22 WAS PULLED FOR SEPARATE DISCUSSION AND \nCONSIDERATION \n22.Agreement with City Net to Provide Street Outreach and Engagement \nServices for Individuals Experiencing Homelessness (Non -General Fund) ",
    "description": "Department(s): Community Development Agency \nRecommended Action: \n1. Authorize the City Manager to execute an agreement with Kingdom Causes, Inc. \ndba City Net, in an annual amount not to exceed $3,750,420, for the Santa Ana \nMultidisciplinary Street Outreach and Engagement (SMART) Program to \nprovide homeless outreach services and non -emergency, non -medical dispatch \nservices for homeless -related calls, for a one-year term from January 1, 2025 \nthrough December 31, 2025, with a one-year renewal option, for a total not -to - \nexceed amount of $7,500,840 for the entire agreement (Agreement No. 2024- \n212). \n2. Authorize the City Manager to execute agreements required by state or federal \nagencies for the use of Homeless Housing, Assistance and Prevention (HHAP) \nfunding, or for any additional funding that may become available. \nCITY COUNCIL 13 DECEMBER 17, 2024 \n\n\nMINUTES: Councilmember Bacerra spoke in opposition to the item and expressed \nconcern regarding the lack of assistance from the County in addressing \nhomelessness. \nCouncilmember Vazquez spoke in support of the item. \nMayor Amezcua requested quarterly reports and spoke in support of the item. \nMayor Pro Tern Phan spoke in support of the item. \nCouncilmember Penaloza spoke in support of the item and expressed concern \nregarding the automatic renewal of the contract. \nCity Manager Alvaro Nunez spoke regarding the term of the contract, quarterly \nreports, and maximizing relationships to achieve objectives. \nBrief discussion ensured regarding services being provided by the City. \nCouncilmember Lopez spoke in support of the item. \nCouncilmember Vazquez requested comparable data on the reports. \nMOTION: Councilmember Vazquez moved to approve the recommended \naction for Agenda Item No. 22, as amended to include a detailed report at the \nend of the year prior to the renewal, seconded by Councilmember Hernandez. \nThe motion carried, 6-1, by the following roll call vote: \nAYES: COUNCILMEMBER HERNANDEZ, COUNCILMEMB",
    "outcome": "PASS",
    "ayes": 6,
    "noes": 1,
    "abstain": 0,
    "absent": 0,
    "meeting_id": 10,
    "meeting_date": "2024-12-17",
    "meeting_type": "regular",
    "member_votes": [
      {
        "member_id": 5,
        "full_name": "Benjamin Vazquez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 4,
        "full_name": "David Penaloza",
        "vote_choice": "AYE"
      },
      {
        "member_id": 3,
        "full_name": "Jessie Lopez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 2,
        "full_name": "Johnathan Ryan Hernandez",
        "vote_choice": "AYE"
      },
      {
        "member_id": 7,
        "full_name": "Phil Bacerra",
        "vote_choice": "NAY"
      },
      {
        "member_id": 6,
        "full_name": "Thai Viet Phan",
        "vote_choice": "AYE"
      },
      {
        "member_id": 1,
        "full_name": "Valerie Amezcua",
        "vote_choice": "AYE"
      }
    ],
    "topics": [
      "Budget & Finance",
      "Public Safety",
      "Infrastructure",
      "Housing",
      "Planning & Development",
      "Community Services",
      "Contracts & Agreements",
      "Appointments",
      "Ordinances & Resolutions",
      "Grants"
    ]
  }
}